; ModuleID = 'kern.c'
source_filename = "kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.5 = type { ptr, ptr, ptr, ptr }
%struct.anon.6 = type { ptr, ptr, ptr }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.packetrec = type { %union.tcp_addr, %union.tcp_addr, i8, i16, i16 }
%union.tcp_addr = type { %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %union.anon.0 }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { %struct.in6_addr, %struct.in6_addr }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon.2 }
%union.anon.2 = type { %struct.anon.3 }
%struct.anon.3 = type { i32, i32 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.datarec = type { i64, i64 }

@xdp_parser_func.____fmt = internal constant [14 x i8] c"got something\00", align 1, !dbg !0
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !73
@xdp_stats_map = dso_local global %struct.anon.5 zeroinitializer, section ".maps", align 8, !dbg !79
@xdp_packets_queue = dso_local global %struct.anon.6 zeroinitializer, section ".maps", align 8, !dbg !105

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 124, type: !281, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "xdp_parser_func", scope: !3, file: !3, line: 94, type: !4, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !174)
!3 = !DIFile(filename: "kern.c", directory: "/home/ncd/git/c-bpf-net-sniffer/sniffer", checksumkind: CSK_MD5, checksum: "26994ac6f1fc1b438281ddc08ebdcc3e")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !9, line: 6198, size: 192, elements: !10)
!9 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "0e8ee22284445bf280d4dd8fb9f52271")
!10 = !{!11, !15, !16, !17, !18, !19}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !8, file: !9, line: 6199, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !13, line: 27, baseType: !14)
!13 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !8, file: !9, line: 6200, baseType: !12, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !8, file: !9, line: 6201, baseType: !12, size: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !8, file: !9, line: 6203, baseType: !12, size: 32, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !8, file: !9, line: 6204, baseType: !12, size: 32, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !8, file: !9, line: 6206, baseType: !12, size: 32, offset: 160)
!20 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !67, globals: !72, splitDebugInlining: false, nameTableKind: None)
!21 = !{!22, !29, !61}
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !9, line: 6187, baseType: !14, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!25 = !DIEnumerator(name: "XDP_DROP", value: 1)
!26 = !DIEnumerator(name: "XDP_PASS", value: 2)
!27 = !DIEnumerator(name: "XDP_TX", value: 3)
!28 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 29, baseType: !14, size: 32, elements: !31)
!30 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "fcee415bb19db8acb968eeda6f02fa29")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!32 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!33 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!34 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!35 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!36 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!37 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!38 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!39 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!40 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!41 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!42 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!43 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!44 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!45 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!46 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!47 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!48 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!49 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!50 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!51 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!52 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!53 = !DIEnumerator(name: "IPPROTO_L2TP", value: 115)
!54 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!55 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!56 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!57 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!58 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!59 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!60 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 1228, baseType: !14, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66}
!63 = !DIEnumerator(name: "BPF_ANY", value: 0)
!64 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!65 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!66 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!67 = !{!68, !69, !70}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !13, line: 24, baseType: !71)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !{!0, !73, !79, !105, !154, !162, !169}
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "_license", scope: !20, file: !3, line: 176, type: !75, isLocal: false, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !77)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !{!78}
!78 = !DISubrange(count: 4)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !20, file: !81, line: 22, type: !82, isLocal: false, isDefinition: true)
!81 = !DIFile(filename: "./../common/xdp_stats_kern.h", directory: "/home/ncd/git/c-bpf-net-sniffer/sniffer", checksumkind: CSK_MD5, checksum: "25bea8477ebc9bcca300b739c08b4d93")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 16, size: 256, elements: !83)
!83 = !{!84, !89, !91, !100}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !81, line: 18, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 6)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !82, file: !81, line: 19, baseType: !90, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !82, file: !81, line: 20, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !94, line: 10, size: 128, elements: !95)
!94 = !DIFile(filename: "./../common/xdp_stats_kern_user.h", directory: "/home/ncd/git/c-bpf-net-sniffer/sniffer", checksumkind: CSK_MD5, checksum: "449a5b2598e78842fe00eb9ff78e80bf")
!95 = !{!96, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !93, file: !94, line: 12, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !13, line: 31, baseType: !98)
!98 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !93, file: !94, line: 13, baseType: !97, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !82, file: !81, line: 21, baseType: !101, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 5)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "xdp_packets_queue", scope: !20, file: !81, line: 29, type: !107, isLocal: false, isDefinition: true)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 24, size: 192, elements: !108)
!108 = !{!109, !114, !149}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !81, line: 26, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 704, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 22)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !107, file: !81, line: 27, baseType: !115, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packetrec", file: !94, line: 22, size: 320, elements: !117)
!117 = !{!118, !145, !146, !147, !148}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !116, file: !94, line: 24, baseType: !119, size: 128)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_addr", file: !94, line: 20, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !94, line: 16, size: 128, elements: !121)
!121 = !{!122, !144}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !120, file: !94, line: 18, baseType: !123, size: 128)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !124, line: 33, size: 128, elements: !125)
!124 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "8bebb780b45d3fe932cc1d934fa5f5fe")
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !123, file: !124, line: 40, baseType: !127, size: 128)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !123, file: !124, line: 34, size: 128, elements: !128)
!128 = !{!129, !135, !141}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !127, file: !124, line: 35, baseType: !130, size: 128)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 128, elements: !133)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !13, line: 21, baseType: !132)
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !{!134}
!134 = !DISubrange(count: 16)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !127, file: !124, line: 37, baseType: !136, size: 128)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, elements: !139)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !138, line: 28, baseType: !70)
!138 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "64bcf4b731906682de6e750679b9f4a2")
!139 = !{!140}
!140 = !DISubrange(count: 8)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !127, file: !124, line: 38, baseType: !142, size: 128)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !77)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !138, line: 30, baseType: !12)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !120, file: !94, line: 19, baseType: !143, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr", scope: !116, file: !94, line: 25, baseType: !119, size: 128, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "isv6", scope: !116, file: !94, line: 26, baseType: !131, size: 8, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !116, file: !94, line: 27, baseType: !70, size: 16, offset: 272)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !116, file: !94, line: 28, baseType: !70, size: 16, offset: 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !107, file: !81, line: 28, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 3200, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 100)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !20, file: !156, line: 177, type: !157, isLocal: true, isDefinition: true)
!156 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/ncd/git/c-bpf-net-sniffer/sniffer", checksumkind: CSK_MD5, checksum: "09cfcd7169c24bec448f30582e8c6db9")
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!69, !160, !12, null}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "bpf_map_push_elem", scope: !20, file: !156, line: 2289, type: !164, isLocal: true, isDefinition: true)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!69, !68, !167, !97}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !20, file: !156, line: 56, type: !171, isLocal: true, isDefinition: true)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!68, !68, !167}
!174 = !{!175, !176, !177, !178, !179, !184, !185, !194, !195, !196, !197, !198, !199, !228, !258, !280}
!175 = !DILocalVariable(name: "ctx", arg: 1, scope: !2, file: !3, line: 94, type: !7)
!176 = !DILocalVariable(name: "data_end", scope: !2, file: !3, line: 96, type: !68)
!177 = !DILocalVariable(name: "data", scope: !2, file: !3, line: 97, type: !68)
!178 = !DILocalVariable(name: "action", scope: !2, file: !3, line: 103, type: !12)
!179 = !DILocalVariable(name: "nh", scope: !2, file: !3, line: 106, type: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !181, line: 33, size: 64, elements: !182)
!181 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/ncd/git/c-bpf-net-sniffer/sniffer", checksumkind: CSK_MD5, checksum: "172efdd203783aed49c0ce78645261a8")
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !180, file: !181, line: 34, baseType: !68, size: 64)
!184 = !DILocalVariable(name: "nh_type", scope: !2, file: !3, line: 107, type: !6)
!185 = !DILocalVariable(name: "eth", scope: !2, file: !3, line: 110, type: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !188, line: 173, size: 112, elements: !189)
!188 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "163f54fb1af2e21fea410f14eb18fa76")
!189 = !{!190, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !187, file: !188, line: 174, baseType: !191, size: 48)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 48, elements: !87)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !187, file: !188, line: 175, baseType: !191, size: 48, offset: 48)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !187, file: !188, line: 176, baseType: !137, size: 16, offset: 96)
!194 = !DILocalVariable(name: "src_addr", scope: !2, file: !3, line: 118, type: !119)
!195 = !DILocalVariable(name: "dst_addr", scope: !2, file: !3, line: 119, type: !119)
!196 = !DILocalVariable(name: "src_port", scope: !2, file: !3, line: 120, type: !70)
!197 = !DILocalVariable(name: "dst_port", scope: !2, file: !3, line: 121, type: !70)
!198 = !DILocalVariable(name: "isv6", scope: !2, file: !3, line: 122, type: !131)
!199 = !DILocalVariable(name: "ip6h", scope: !200, file: !3, line: 128, type: !202)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 127, column: 2)
!201 = distinct !DILexicalBlock(scope: !2, file: !3, line: 126, column: 6)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !204, line: 118, size: 320, elements: !205)
!204 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "5119f4e1c8becf2f187fa2b4015ad457")
!205 = !{!206, !207, !208, !212, !213, !214, !215}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !203, file: !204, line: 120, baseType: !131, size: 4, flags: DIFlagBitField, extraData: i64 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !203, file: !204, line: 121, baseType: !131, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !203, file: !204, line: 128, baseType: !209, size: 24, offset: 8)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 24, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 3)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !203, file: !204, line: 130, baseType: !137, size: 16, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !203, file: !204, line: 131, baseType: !131, size: 8, offset: 48)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !203, file: !204, line: 132, baseType: !131, size: 8, offset: 56)
!215 = !DIDerivedType(tag: DW_TAG_member, scope: !203, file: !204, line: 134, baseType: !216, size: 256, offset: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !203, file: !204, line: 134, size: 256, elements: !217)
!217 = !{!218, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, scope: !216, file: !204, line: 134, baseType: !219, size: 256)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !204, line: 134, size: 256, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !219, file: !204, line: 134, baseType: !123, size: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !219, file: !204, line: 134, baseType: !123, size: 128, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !216, file: !204, line: 134, baseType: !224, size: 256)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !204, line: 134, size: 256, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !224, file: !204, line: 134, baseType: !123, size: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !224, file: !204, line: 134, baseType: !123, size: 128, offset: 128)
!228 = !DILocalVariable(name: "iph", scope: !229, file: !3, line: 145, type: !231)
!229 = distinct !DILexicalBlock(scope: !230, file: !3, line: 144, column: 2)
!230 = distinct !DILexicalBlock(scope: !201, file: !3, line: 143, column: 11)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !233, line: 87, size: 160, elements: !234)
!233 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "149778ace30a1ff208adc8783fd04b29")
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !245}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !232, file: !233, line: 89, baseType: !131, size: 4, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !232, file: !233, line: 90, baseType: !131, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !232, file: !233, line: 97, baseType: !131, size: 8, offset: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !232, file: !233, line: 98, baseType: !137, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !232, file: !233, line: 99, baseType: !137, size: 16, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !232, file: !233, line: 100, baseType: !137, size: 16, offset: 48)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !232, file: !233, line: 101, baseType: !131, size: 8, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !232, file: !233, line: 102, baseType: !131, size: 8, offset: 72)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !232, file: !233, line: 103, baseType: !244, size: 16, offset: 80)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !138, line: 34, baseType: !70)
!245 = !DIDerivedType(tag: DW_TAG_member, scope: !232, file: !233, line: 104, baseType: !246, size: 64, offset: 96)
!246 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !233, line: 104, size: 64, elements: !247)
!247 = !{!248, !253}
!248 = !DIDerivedType(tag: DW_TAG_member, scope: !246, file: !233, line: 104, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !246, file: !233, line: 104, size: 64, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !249, file: !233, line: 104, baseType: !143, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !249, file: !233, line: 104, baseType: !143, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !246, file: !233, line: 104, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !246, file: !233, line: 104, size: 64, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !254, file: !233, line: 104, baseType: !143, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !254, file: !233, line: 104, baseType: !143, size: 32, offset: 32)
!258 = !DILocalVariable(name: "tcph", scope: !2, file: !3, line: 163, type: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !261, line: 25, size: 160, elements: !262)
!261 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "0fb7164446a017a2406c1e3b94b6d7a6")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !260, file: !261, line: 26, baseType: !137, size: 16)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !260, file: !261, line: 27, baseType: !137, size: 16, offset: 16)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !260, file: !261, line: 28, baseType: !143, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !260, file: !261, line: 29, baseType: !143, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !260, file: !261, line: 31, baseType: !70, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !260, file: !261, line: 32, baseType: !70, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !260, file: !261, line: 33, baseType: !70, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !260, file: !261, line: 34, baseType: !70, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !260, file: !261, line: 35, baseType: !70, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !260, file: !261, line: 36, baseType: !70, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !260, file: !261, line: 37, baseType: !70, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !260, file: !261, line: 38, baseType: !70, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !260, file: !261, line: 39, baseType: !70, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !260, file: !261, line: 40, baseType: !70, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !260, file: !261, line: 55, baseType: !137, size: 16, offset: 112)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !260, file: !261, line: 56, baseType: !244, size: 16, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !260, file: !261, line: 57, baseType: !137, size: 16, offset: 144)
!280 = !DILabel(scope: !2, name: "out", file: !3, line: 172)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 112, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 14)
!284 = !{i32 7, !"Dwarf Version", i32 5}
!285 = !{i32 2, !"Debug Info Version", i32 3}
!286 = !{i32 1, !"wchar_size", i32 4}
!287 = !{i32 7, !"frame-pointer", i32 2}
!288 = !{!"clang version 16.0.6"}
!289 = distinct !DISubprogram(name: "xdp_port_rewrite_func", scope: !3, file: !3, line: 57, type: !4, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !290)
!290 = !{!291}
!291 = !DILocalVariable(name: "ctx", arg: 1, scope: !289, file: !3, line: 57, type: !7)
!292 = !DILocation(line: 0, scope: !289)
!293 = !DILocation(line: 59, column: 2, scope: !289)
!294 = distinct !DISubprogram(name: "xdp_vlan_swap_func", scope: !3, file: !3, line: 66, type: !4, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !295)
!295 = !{!296, !297, !298, !299, !300, !301}
!296 = !DILocalVariable(name: "ctx", arg: 1, scope: !294, file: !3, line: 66, type: !7)
!297 = !DILocalVariable(name: "data_end", scope: !294, file: !3, line: 68, type: !68)
!298 = !DILocalVariable(name: "data", scope: !294, file: !3, line: 69, type: !68)
!299 = !DILocalVariable(name: "nh", scope: !294, file: !3, line: 72, type: !180)
!300 = !DILocalVariable(name: "nh_type", scope: !294, file: !3, line: 73, type: !6)
!301 = !DILocalVariable(name: "eth", scope: !294, file: !3, line: 76, type: !186)
!302 = !DILocation(line: 0, scope: !294)
!303 = !DILocation(line: 68, column: 38, scope: !294)
!304 = !{!305, !306, i64 4}
!305 = !{!"xdp_md", !306, i64 0, !306, i64 4, !306, i64 8, !306, i64 12, !306, i64 16, !306, i64 20}
!306 = !{!"int", !307, i64 0}
!307 = !{!"omnipotent char", !308, i64 0}
!308 = !{!"Simple C/C++ TBAA"}
!309 = !DILocation(line: 68, column: 27, scope: !294)
!310 = !DILocation(line: 68, column: 19, scope: !294)
!311 = !DILocation(line: 69, column: 34, scope: !294)
!312 = !{!305, !306, i64 0}
!313 = !DILocation(line: 69, column: 23, scope: !294)
!314 = !DILocation(line: 69, column: 15, scope: !294)
!315 = !DILocalVariable(name: "nh", arg: 1, scope: !316, file: !181, line: 124, type: !319)
!316 = distinct !DISubprogram(name: "parse_ethhdr", scope: !181, file: !181, line: 124, type: !317, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !321)
!317 = !DISubroutineType(types: !318)
!318 = !{!6, !319, !68, !320}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!321 = !{!315, !322, !323}
!322 = !DILocalVariable(name: "data_end", arg: 2, scope: !316, file: !181, line: 125, type: !68)
!323 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !316, file: !181, line: 126, type: !320)
!324 = !DILocation(line: 0, scope: !316, inlinedAt: !325)
!325 = distinct !DILocation(line: 77, column: 12, scope: !294)
!326 = !DILocalVariable(name: "nh", arg: 1, scope: !327, file: !181, line: 79, type: !319)
!327 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !181, file: !181, line: 79, type: !328, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !337)
!328 = !DISubroutineType(types: !329)
!329 = !{!6, !319, !68, !320, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !181, line: 64, size: 32, elements: !332)
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !331, file: !181, line: 65, baseType: !334, size: 32)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 2)
!337 = !{!326, !338, !339, !340, !341, !342, !343, !349, !350}
!338 = !DILocalVariable(name: "data_end", arg: 2, scope: !327, file: !181, line: 80, type: !68)
!339 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !327, file: !181, line: 81, type: !320)
!340 = !DILocalVariable(name: "vlans", arg: 4, scope: !327, file: !181, line: 82, type: !330)
!341 = !DILocalVariable(name: "eth", scope: !327, file: !181, line: 84, type: !186)
!342 = !DILocalVariable(name: "hdrsize", scope: !327, file: !181, line: 85, type: !6)
!343 = !DILocalVariable(name: "vlh", scope: !327, file: !181, line: 86, type: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !181, line: 42, size: 32, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !345, file: !181, line: 43, baseType: !137, size: 16)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !345, file: !181, line: 44, baseType: !137, size: 16, offset: 16)
!349 = !DILocalVariable(name: "h_proto", scope: !327, file: !181, line: 87, type: !70)
!350 = !DILocalVariable(name: "i", scope: !327, file: !181, line: 88, type: !6)
!351 = !DILocation(line: 0, scope: !327, inlinedAt: !352)
!352 = distinct !DILocation(line: 129, column: 9, scope: !316, inlinedAt: !325)
!353 = !DILocation(line: 93, column: 14, scope: !354, inlinedAt: !352)
!354 = distinct !DILexicalBlock(scope: !327, file: !181, line: 93, column: 6)
!355 = !DILocation(line: 93, column: 24, scope: !354, inlinedAt: !352)
!356 = !DILocation(line: 93, column: 6, scope: !327, inlinedAt: !352)
!357 = !DILocation(line: 99, column: 17, scope: !327, inlinedAt: !352)
!358 = !{!359, !359, i64 0}
!359 = !{!"short", !307, i64 0}
!360 = !DILocalVariable(name: "h_proto", arg: 1, scope: !361, file: !181, line: 68, type: !70)
!361 = distinct !DISubprogram(name: "proto_is_vlan", scope: !181, file: !181, line: 68, type: !362, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !364)
!362 = !DISubroutineType(types: !363)
!363 = !{!6, !70}
!364 = !{!360}
!365 = !DILocation(line: 0, scope: !361, inlinedAt: !366)
!366 = distinct !DILocation(line: 106, column: 8, scope: !367, inlinedAt: !352)
!367 = distinct !DILexicalBlock(scope: !368, file: !181, line: 106, column: 7)
!368 = distinct !DILexicalBlock(scope: !369, file: !181, line: 105, column: 39)
!369 = distinct !DILexicalBlock(scope: !370, file: !181, line: 105, column: 2)
!370 = distinct !DILexicalBlock(scope: !327, file: !181, line: 105, column: 2)
!371 = !DILocation(line: 70, column: 20, scope: !361, inlinedAt: !366)
!372 = !DILocation(line: 70, column: 46, scope: !361, inlinedAt: !366)
!373 = !DILocation(line: 106, column: 7, scope: !368, inlinedAt: !352)
!374 = !DILocation(line: 112, column: 18, scope: !368, inlinedAt: !352)
!375 = !DILocation(line: 88, column: 1, scope: !294)
!376 = !DILocation(line: 118, column: 11, scope: !2)
!377 = !DILocation(line: 119, column: 11, scope: !2)
!378 = !DILocation(line: 0, scope: !2)
!379 = !DILocation(line: 96, column: 38, scope: !2)
!380 = !DILocation(line: 96, column: 27, scope: !2)
!381 = !DILocation(line: 96, column: 19, scope: !2)
!382 = !DILocation(line: 97, column: 34, scope: !2)
!383 = !DILocation(line: 97, column: 23, scope: !2)
!384 = !DILocation(line: 97, column: 15, scope: !2)
!385 = !DILocation(line: 0, scope: !316, inlinedAt: !386)
!386 = distinct !DILocation(line: 116, column: 12, scope: !2)
!387 = !DILocation(line: 0, scope: !327, inlinedAt: !388)
!388 = distinct !DILocation(line: 129, column: 9, scope: !316, inlinedAt: !386)
!389 = !DILocation(line: 93, column: 14, scope: !354, inlinedAt: !388)
!390 = !DILocation(line: 93, column: 24, scope: !354, inlinedAt: !388)
!391 = !DILocation(line: 93, column: 6, scope: !327, inlinedAt: !388)
!392 = !DILocation(line: 118, column: 2, scope: !2)
!393 = !DILocation(line: 119, column: 2, scope: !2)
!394 = !DILocation(line: 124, column: 2, scope: !395)
!395 = distinct !DILexicalBlock(scope: !2, file: !3, line: 124, column: 2)
!396 = !DILocation(line: 126, column: 6, scope: !2)
!397 = !DILocation(line: 99, column: 17, scope: !327, inlinedAt: !388)
!398 = !DILocation(line: 0, scope: !361, inlinedAt: !399)
!399 = distinct !DILocation(line: 106, column: 8, scope: !367, inlinedAt: !388)
!400 = !DILocation(line: 70, column: 20, scope: !361, inlinedAt: !399)
!401 = !DILocation(line: 70, column: 46, scope: !361, inlinedAt: !399)
!402 = !DILocation(line: 106, column: 7, scope: !368, inlinedAt: !388)
!403 = !DILocation(line: 112, column: 18, scope: !368, inlinedAt: !388)
!404 = !DILocalVariable(name: "nh", arg: 1, scope: !405, file: !181, line: 132, type: !319)
